Repository: 84000/data-translation-memory
Catalog: toh381_84000-emergence-from-samputa.tmx
Source language: bo
Languages: en

source: བདུད་རྩིའི་བསམ་གཏན་དམིགས་ནས་ནི། །བདུད་རྩིས་ཁ་ནི་དགང་བར་བྱ། །ལས་སོགས་བསམས་ནས་རྣལ་འབྱོར་དང་། །རྣལ་འབྱོར་མ་ནི་བསྒོམ་པར་བྱ།
en: “Relying on the contemplation of ambrosia and filling thereby the mouths of the deities with it, he should meditate on yogins and yoginīs as the executors of any activity he can think of.

source: །ལས་རྣམས་ཐམས་ཅད་རབ་འགྲུབ་འགྱུར།
en: He will then succeed in every type of activity.

source: །ཧས་ནི་ཁ་དོག་འཕྲོག་པར་བྱེད།
en: “The syllable ha removes the ambrosia’s ordinary color,

source: །ཧོས་ནི་དྲི་ནི་འཇིག་པར་བྱེད།
en: The syllable ho neutralizes its ordinary odor,

source: །ཧྲཱིཿནི་བརྩོན་འགྲུས་འཇོམས་པར་ནི།
en: And the syllable hrī removes its ordinary potency—

source: །རིམ་པ་འདི་ནི་བརྗོད་པར་བྱ།
en: This is the prescribed order of reciting these three syllables.

source: །རྣམ་གསུམ་ལན་གསུམ་བརྗོད་པས་ནི།
en: “Repeating these three syllables thrice,

source: གསུམ་གྱིས་ལྷ་རྣམས་ཚིམ་པར་བྱ།
en: He should meditate on them as the three deities.

source: །པདྨའི་དབང་ཕྱུག་གཟུགས་གསེར་མདོག །གཟི་བརྗིད་དྲི་ཆུ་རྣམ་སྣང་དང་། །རྡོ་རྗེའི་དབང་ཕྱུག་མྱང་བ་ནི།
en: “Padmeśvara possesses the beauty and loveliness of gold; The beautifully lucent one possesses an incorruptible perfume; And Vajrapāṇi is the vajra lord of good flavor.

source: །ལག་ན་རྡོ་རྗེ་ལྷ་གསུམ་དག །རྣམ་པ་གསུམ་དུ་ཤེས་པར་བྱ།
en: These three deities are known as the above three syllables.

source: །འདིར་ནི་ཆོས་རྣམས་བཟང་པོར་ལྟོས།
en: ‘See all phenomena here as pure!

source: །འདུ་བ་རྣམས་ལ་ཐེ་ཚོམ་མེད།
en: Discard nihilist meditation!

source: །བྲམ་ཟེ་ཁྱི་དང་གདོལ་པ་རྣམས།
en: Since brahmins, dogs, and outcastes are

source: །རང་བཞིན་གཅིག་པ་ཉིད་དུ་ཟོ།
en: Of the same nature, eat

source: །ཚིགས་བཅད་འདིས་ནི་དེ་ནས་སྦྱིན།
en: “Reciting the lines of this verse, he should offer

source: །རོལ་བཅས་མཆོག་ཏུ་རྗེས་བསྐོར་བས།
en: And then display the gesture of “turning the lotus”

source: །གཡོན་དང་གཡས་པའི་ལག་པ་ཡིས།
en: “With his left and right hands, Playfully and with supreme grace.

source: །འདོད་པས་བསྐོར་བར་བྱ་བའོ།
en: He should proceed according to instruction

source: །རང་འདོད་ལྷ་ཡི་རྣལ་འབྱོར་གྱིས།
en: Through the practice of his personal deity.

source: །ཇི་ལྟར་རབ་ཏུ་བསྒྱུར་བས་འཇུག །བདེ་གཤེགས་ཆོས་ནི་རིན་ཐང་མེད།
en: ‘The Sugata’s teaching is priceless;

source: །འདོད་ཆགས་དྲི་མ་རྣམ་པར་བསལ།
en: It is free from the stains of passion

source: །གཟུང་དང་འཛིན་པ་རྣམ་པར་སྤངས།
en: And from grasping and non-grasping.

source: །གུས་པས་དེ་ལ་ཕྱག་འཚོལ་ཅིག །ཚིགས་བཅད་འདིས་ནི་བླང་བར་བྱ།
en: Let us pay homage to it with devotion.’ “With this verse, he should receive

source: །ཡང་དག་སྤྱོད་པའི་དེ་ཉིད་འདི། །གཙང་སྦྲ་ཀུན་དུ་རྣལ་འབྱོར་པའི།
en: This is the principle of the yogin’s proper practice, pure in every respect.

source: །ཇི་ལྟར་བདེ་བ་ཞེས་བྱར་བརྗོད།
en: “He should then recite the following as he wishes: “ ‘Let us pay homage to the one who is free from becoming

source: །ཡན་ལག་ཡན་ལག་བདེ་གསོལ་འདེབས། །གཉིས་གཉིས་འཁྱུད་པའི་སྦྱོར་བ་ཡི།
en: And supplicate him that beings may reach pleasant destinies.

source: །སྒྱུ་མ་ཡིས་ནི་རྣམ་པར་བརྒྱན།
en: May they be adorned with the magical display

source: །དངོས་པོ་རྣམ་གྲོལ་ཕྱག་འཚོལ་ཅིག །རྡོ་རྗེ་དྲིལ་བུའི་སྒྲ་རྣམས་ཀྱིས།
en: Of the coupling embrace, hūṁ hūṁ hūṁ

source: །ཅི་འདོད་པ་ཡི་བཀྲ་ཤིས་གླུས།
en: “He should sing this song of benediction

source: །ཧཱུྃ་ཧཱུྃ་ཧཱུྃ།
en: To the accompaniment of the bell.

source: རྡོ་རྗེ་ཐལ་མོ་སྦྱར་བྱས་ནས།
en: “Folding his hands in the vajra gesture of añjali,

source: །སྙིང་ག་རུ་ནི་གཟུང་བར་བྱ།
en: He should position them at his heart. Then, he should make a dedication

source: །དེ་ནས་སེམས་ཅན་ཀུན་སོགས་ལ། །སྨོན་ལམ་རྣམས་ནི་གདབ་བྱ་བ།
en: For the sake of all sentient beings, and so forth, reciting:

source: །སེམས་ཅན་ཐམས་ཅད་བདེ་གྱུར་ཅིག །སེམས་ཅན་ཐམས་ཅད་སྐྱོན་མེད་པར།
en: ‘May all beings be happy! May all beings be well!

source: །གང་གི་ལམ་གྱིས་འགྲོ་འགྱུར་བ།
en: May they traverse the path

source: །དེ་ནི་སངས་རྒྱས་ཉིད་ཐོབ་གྱུར།
en: By which they will attain awakening!

source: །མ་བསྒྲལ་བ་དག་བསྒྲལ་བ་བགྱི།
en: ‘I will deliver those who have not been delivered.

source: །མ་གྲོལ་བ་དག་བདག་གིས་དགྲོལ། །རྣལ་འབྱོར་བསྟན་བཅོས་བྱ་བའི་དངོས།
en: I will release those who have not been released.

source: །ད་ལྟ་རུ་ནི་ཡང་དག་བརྟགས།
en: I will be compassionate toward them in their present condition,

source: །རྡོ་རྗེ་ཁུ་ཚུར་དམ་བཅིངས་ནས།
en: Acting consistently with the teachings of yoga.’ “He should form the ‘vajra fist’ with both hands.

source: །གཡོན་པ་སྙིང་གར་གཞག་པར་བྱ།
en: Placing the left fist at his heart,

source: །ལག་པ་གཡས་པ་བརྐྱང་ནས་ནི།
en: He should extend the right one forward and,

source: །ས་ལ་བཞག་ནས་གཤེགས་སུ་གསོལ།
en: Placing it on the ground, dismiss the deities by saying: “ Oṁ , Please remain in my body!

source: །ཨོཾ་ཨཱཏྨ་ཏིཥྛ་ཧཱུྃ་སྭཱ་ཧཱ།
en: Hūṁ svāhā

source: ཕྱི་ནི་བདག་གི་དབུགས་ཀྱིས་ནི།
en: “Subsequently, the deities are absorbed

source: །བདག་གི་ལུས་ལ་ཐིམ་པར་བྱ།
en: Into his body with his breath.

source: །བདག་གི་དངོས་པོས་མཆོད་པར་བྱ།
en: Visualizing himself as the deity. “He should recite: “ Oṁ , seize, seize the evil ones and depart!

source: །ཨོཾ་སརྦྦ་དུཥྚ་གྲྀཧྞ་གྲྀཧྞ་གཙྪ་ཧཱུྃ་ཕཊ།
en: Hūṁ phaṭ

source: སེ་གོལ་གསུམ་གཏོགས་ནས་ཕྱི་རོལ་གྱི་ལྷ་རྣམས་གཤེགས་སུ་གསོལ་བར་བྱའོ།
en: “He should snap his fingers three times and dismiss the outer deities.”

source: །དགུ་པ་ལས་གཏོར་མའི་མཆོད་པ་སྟེ་རབ་ཏུ་བྱེད་པ་གཉིས་པའོ།། །།གསང་བའི་པདྨ་བདེ་བ་ཅན།
en: This concludes the second part of the ninth chapter, about the offering of oblation.

source: །ཐམས་ཅད་བདག་ཉིད་རྟག་བཞུགས་ལ།
en: While the Blessed One, ever-present in every body, Was abiding within the secret lotus, the pleasure realm of Sukhāvatī,

source: །གསང་བ་ལ་ནི་རྣམ་གནས་ནས།
en: The goddess who, for her own part, abides in secrecy,

source: །དེ་ལ་ལྷ་མོ་དེས་ཞུས་པ།
en: Requested the following: “Please tell me everything, O lord!

source: །སྦས་པ་དམ་པའི་དངོས་སྤྱོད་ཡུལ།
en: Tell me about the hidden domain of sublime reality,

source: །བདེ་གཤེགས་ཀུན་གྱི་དཀྱིལ་འཁོར་དང་། །ཁྲོ་བོ་རྣམས་དང་ལྷ་རྣམས་དང་། །ཐམས་ཅད་ལྷ་ནི་ཁྱོད་ཀྱིས་གསུངས།
en: About the maṇḍala of all the tathāgatas, And also about the wrathful ones and the deities. “I do know the ultimate reality

source: །ཇི་ལྟར་ནང་ལ་རྣམ་གནས་པའི། །དེ་ཉིད་བླ་མེད་བདག་འཚལ་ཡང་།
en: Which is present within myself,

source: །བདག་ལ་ད་དུང་ཐེ་ཚོམ་མཆིས།
en: But I am not certain regarding the methods

source: །གང་གི་ཆོ་གས་བྲིས་སྐུ་དང་། །གླེགས་བམ་ཡང་ནི་བྲི་བར་བགྱི།
en: Of making the painting and writing the manuscript.

source: །ལྷ་ལགས་འདི་དག་མི་འཚལ་བས། །བདེ་བ་ཆེན་པོས་བཤད་དུ་གསོལ།
en: “I do not know that, so please tell me, O Great Bliss!”

source: །དེ་བདག་ལང་ཚོ་དལ་བ་དང་། །རྒྱས་ཤིང་རྣམ་རྟོག་མེད་པ་དང་། །ཁྲོ་མེད་ལྐོག་འཕྱས་མེད་པ་དང་། །ཤིན་ཏུ་ཆ་ཕྲ་མཁས་སྤྲོ་དང་། །བཟོད་དང་དད་པ་སྙིང་རྗེ་ལྡན། །དེ་ལྟར་གྱུར་པའི་རི་མོ་མཁན།
en: “The painter should be a young person with a pure heart, Steadfast, gentle, and free of discursive thinking. He should be free of deceit and anger, well trained, Dexterous, and full of faith and compassion.

source: །ཡང་ན་དམ་ཚིག་ཅན་གྱི་ཡང་། །རི་མོ་མཁན་གྱིས་བྲི་བར་བྱ།
en: “Alternatively, to do the painting, one should commission a painter who has been given the samaya.

source: །སྒྲུབ་པ་པོ་དམ་པས་དཔའ་བོ་ཤི་བའི་རས་སམ། རོ་ལ་དཀྲིས་པའི་རས་སམ། བུ་བཙས་པའི་རས་སམ། ཁྲག་ཆེན་པོས་བཙོས་པའི་རས་སམ། བུད་མེད་ཀྱི་མེ་ཏོག་གིས་རབ་ཏུ་བསྒྲུབས་པའི་རས་རྣམས་ལ་སྒྲོལ་མ་དང་། འོད་ཟེར་ཅན་དང་། དེ་བཞིན་དུ་ནི་རི་ཁྲོད་མ་ཤིང་ལོ་ཅན་ལ་སོགས་བྲི་བར་བྱའོ།
en: Such a sublime practitioner should paint Tārā, Mārīcī, or Parṇaśāvarī on cloth from a fallen war hero, cloth that wrapped a corpse, cloth used during childbirth, cloth stained with human blood, or cloth soaked with menstrual blood. “This is the procedure to follow.

source: །དེ་ལ་འདིའི་ཆོ་ག་ནི་གསང་བའི་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཤིན་ཏུ་མཉམ་པར་གཞག་པས་འདྲིར་གཞུག་པར་བྱའོ།
en: Staying at a secret location, one should have a well-focused person do the painting;

source: །སྐྱེས་པའི་ཐོད་པར་གནས་པར་ཇི་ལྟར་གསུངས་པའི་ཁ་དོག་ལྔ་སིཧླ་དང་། ག་བུར་ལ་སོགས་པ་བསྲེས་པ་དང་། རོའི་སྐྲའི་པིར་གྱིས་བྲིས་སྐུ་འཇིགས་པ་བྲི་བར་བྱའོ།
en: he should paint the frightening form with a brush of a corpse’s hair, using the five colors as explained, mixed with olibanum, camphor, and other ambrosias, placed in a human skull.

source: །དང་པོར་སློབ་དཔོན་གྱིས་མཉམ་པར་གཞག་པས་ཤེས་རབ་དང་ལྡན་ཞིང་། །རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ་དང་། །དཔལ་ཡང་དག་པར་སྦྱོར་བའི་རྣལ་འབྱོར་དང་ལྡན་པས་ཡན་ལག་ལ་ནི་རྃ་ཤུ་བསམ་ཞིང་གཅེར་བུར་གྱུར་པ་དང་། དེ་བཞིན་དུ་ཡང་ལྷག་མ་དང་། མ་དག་པས་མཁས་པས་མི་བྱའོ།
en: “First, the teacher, well focused, united in embrace with the consort , adorned with all manner of jewelry, and abiding in union with the glorious Sampuṭa, should take off his clothes, while visualizing himself as wearing bone ornaments. “The wise should not have the painting done with leftover or impure materials.”

source: །ཀྱེ་བཅོམ་ལྡན་འདས་གལ་ཏེ་སིཧླ་ལ་སོགས་པས་བསྲེས་པ་ལགས་ན། དེའི་ཚེ་ཇི་ལྟར་མ་དག་པ་ལགས།
en: “O Blessed One, if the paints are infused with olibanum , how then would they not be impure?”

source: །ཕོ་ཉ་གཙང་སྦྲ་དང་པོ་སྟེ།
en: “The first purity is the messenger lady,

source: །གཉིས་པ་ལ་ནི་ཞི་བར་འདོད།
en: Moon is regarded as the second,

source: །སྣོད་གཅིག་ཏུ་ནི་ཟས་ཉིད་ནི།
en: And all the dainty foodstuffs together

source: །གཙང་སྦྲ་གསུམ་པ་ཉིད་དུ་གསུངས།
en: Are said to be the third purity. “These purities should be undertaken

source: །ཕྱི་རོལ་རྣལ་འབྱོར་ལ་དགའ་བས། །གཙང་སྦྲ་འདི་དག་ཡང་དག་བརྩམ།
en: By those who enjoy external yoga.

source: །རང་སེམས་དྲི་མ་ཅན་གྱུར་ལ།
en: Should one’s mind become impure,

source: །གནས་ནི་འདི་ཡིས་ཅི་ཞིག་དགོས།
en: Of what use would be ritual ablutions?

source: །གང་ཡང་ལོག་པའི་ཆོས་གནས་པ།
en: “Anyone who lives by a perverse Dharma,

source: །འདོད་པའི་དོན་ཀུན་འདོད་པ་ནི།
en: Desiring all kinds of sense pleasures,

source: །ཁྱི་ཡི་སྐྱེ་གནས་བརྒྱར་འགྲོ་སྟེ།
en: Will be born one hundred times as a dog,

source: །སྨེ་ཤ་ཅན་དུ་སྐྱེ་བར་འགྱུར།
en: And later be reborn among the outcastes.

source: །དཔེར་ན་ཁ་ཅིག་མར་དོན་གཉེར།
en: “Just as someone who wants ghee

source: །དད་པས་ཆུ་ནི་བསྲུབ་གྱུར་ཀྱང་།
en: But naively churns water,

source: །མར་སར་ཐོབ་པར་མི་འགྱུར་ཏེ།
en: Does not obtain ghee

source: །ལུས་ཉོན་མོངས་པ་ཁོ་ནར་ཟད།
en: But only physical exhaustion,

source: །འཛིན་དང་མཆོད་པ་མ་གཏོགས་པར།
en: “So too will the concentration and veneration

source: །གཞན་དུ་བཟང་མོ་དོན་མེད་འགྱུར།
en: Of those with other such aims be futile—

source: །འཚོ་བའི་ཐབས་ཀྱི་རྒྱུ་ཡི་ཕྱིར།
en: If it is for the sake of vitality,

source: །རྣལ་འབྱོར་གཞན་ལ་བརྟེན་པ་ཉིད།
en: They should rather resort to other types of yoga.

source: །དུང་དང་ཉ་ཕྱིས་མུ་ཏིག་རྣམས།
en: “Who would disparage the skull

source: །གསུམ་ཆར་རྒྱུ་ལས་བྱུང་བ་ཉིད།
en: That embodies the dharmakāya—

source: །ཆོས་ཀྱི་སྐུ་ཡི་ལུས་ཅན་གྱི།
en: The skull arisen from the material cause

source: །ཐོད་པ་ལ་ནི་སུ་ཞིག་སྨོད།
en: Common to the triad of conch, oyster shell, and pearl?

source: །མཆོད་ཕྱིར་ཐོགས་པ་དག་བྱེད་ཀྱང་།
en: “The means of purification of those invested with the sacred cord

source: །དམ་པའི་ཆོས་ཀྱི་རིམ་པར་གསུངས།
en: Is said to be their conduct conforming to the true Dharma.

source: །གཙང་སྦྲ་ཧེ་རུ་ཀ་དཔལ་གནས། །དེ་ཕྱིར་ཀུན་དུ་རབ་འབད་པས།
en: Since the purity is found in the glorious Heruka,

source: །ཕྱག་རྒྱ་ལྷན་ཅིག་སྒྲུབ་པས་མཆོད།
en: One should worship with all perseverance Together with one’s consort . “The practitioner should thus place his personal consort to his left.

source: །ཤིན་ཏུ་བཞིན་མཛེས་སྙིང་རྗེ་ཅན། གཟུགས་དང་ལང་ཚོ་སྐལ་བཟང་མ། །གཟུགས་བཟང་སྒྲུབ་པ་པོ་ལ་དགའ།
en: She should have a beautiful face and fine figure, be compassionately disposed, be graced with beauty and youth, and be fond of the practitioner.

source: །རང་གི་ཕྱག་རྒྱ་གཡོན་དུ་གཞག །པིར་ལ་བྱིན་བརླབས་འདྲི་མཁན་ལ།
en: One should consecrate the brush and give it to the painter.

source: །བྱིན་ཏེ་བྲིས་སྐུ་འཇིགས་པ་ནི།
en: “The painter should make a painting that inspires

source: །དངོས་གྲུབ་ཐམས་ཅད་རབ་སྟེར་བ།
en: Dread and bounteously grants all accomplishments.

source: །དེ་ནས་ཡང་དག་བྲི་བར་བྱ།
en: It should be viewed by the painter and the practitioner,

source: །འཇིག་རྟེན་གཞན་ལ་མི་བསྟན་ཞིང་།
en: Without being shown to anyone else.

source: །རི་མོ་མཁན་དང་སྒྲུབ་པོས་བལྟ།
en: “Listen, O goddess of great fortune!

source: །གླེགས་བམ་ཁྱོད་ལ་བཤད་བྱ་ཡིས།
en: I will now teach you about the writing of the manuscript.

source: །གྲོ་གའམ་ཏ་ལའི་འདབ་མ་ལ།
en: Should write it either on birchbark or palm leaf. “One should make the folios

source: །གླེགས་བམ་སོར་ནི་བཅུ་གཉིས་པ།
en: Twelve fingers long

source: །སྦྲང་ཚན་སྣག་ཚ་བྱས་ནས་ནི།
en: And use ‘great honey’ as ink.

source: །མི་ཡི་རུས་པའི་སྨྱུ་གུ་ཡིས། །དམ་ཚིག་ཅན་གྱིས་བྲི་བར་བྱ།
en: It should be written with a stylus of human bone. “Should an inappropriate person see

source: །གླེགས་བམ་དང་ནི་བྲིས་སྐུ་ཉིད། །གལ་ཏེ་སྐལ་བ་མེད་མཐོང་ན།
en: Either the manuscript or the painting,

source: །སྐྱེ་བ་འདིར་ནི་འགྲུབ་མི་འགྱུར།
en: No accomplishment will be had in this life,

source: །འཇིག་རྟེན་ཕ་རོལ་སྤྱོད་ཡུལ་མིན། །དམ་ཚིག་སེམས་དཔའ་སྦྱིན་པར་བྱ།
en: Nor in the domains of the afterlife. “One should never allow others

source: །རེས་འགའ་ཙམ་ཞིག་བསྟན་པའོ།
en: To see the samayasattva.

source: །གླེགས་བམ་ལམ་གྱི་སྤྱོད་ཡུལ་དུ།
en: When in public view, one should hide

source: །སྐྲ་དང་མཆན་ཁུང་དག་དུ་སྦ།
en: The book in one’s hair or under the armpit.

source: །དམ་ཚིག་སེམས་དཔའ་སྦྱིན་པར་བྱ།
en: “One can, however, lend it to those who share the same samaya, So that they can copy it prior to performing the ritual.”

source: །དགུ་པ་ལས་བྲིས་སྐུ་དང་གླེགས་བམ་གཏན་ལ་དབབ་པ་ཞེས་བྱ་བ་སྟེ་རབ་ཏུ་བྱེད་པ་གསུམ་པའོ།།
en: This concludes the third part of the ninth chapter, called “The Codification of the Painting and the Manuscript.”

source: །།སིལ་སྙན་ཡང་དག་སྦྱོར་མཚན་ཉིད།
en: “Listen, O goddess, I will now teach the music

source: །ཨ་ར་ཨ་ར་ཛེཾ་ཛེཾ་སྨ་ར་སྨ་ར་ཙ་ཊ་བྃ་ཧོཿར་ཊ་བྃ་ཧོ་ཧུ་ལུ་ཧུ་ལུ་ཧཱུྃ་ཛཿཧཱུྃ་ཛཿ ཨ་ལ་ཨ་ལ་ཧཱུ་ཎུ་ཧཱུ་ཎུ་ཧཱུ་ཎུ།
en: “The mantra of Vajradhara and the others is:

source: ཧྲྃ་ཧྲྃ་ཧྲྃ་ཧུ་ཏྃ་གྷཻ་ཧུ་ཏྃ་གྷཻ་གྷཻ་གྷཻ་གྷཻ་ཏ་ཊ་གྷཻ་གྷཻ་ཏྃ་ཊ་གྷཻ་གྷཻཾ་ཏ་གྷཻ་ཏ་གྷཻ་ཏ་གྷཻ་ཧོནྡོ་ཧནྡོ་དོ་ཧཱུྃ་དོ་ཧཱུྃ།
en: “Ara ara, jeṁ jeṁ! Recollect recollect! Vaṁ, hoḥ hoḥ! Hulu hulu! Rulu rulu!

source: ཀ་ཀ་ཀ་ཀ །ཀཽ་ཀཽ་ཀཽ །ཀཽཾ་ཀཽཾ་ཀཽཾ །བཻྃ་ཀཻྃ་བཻྃ་ཀཻྃ་བཻྃ་ཀཻྃ །བིྃ་བཛྲ་བཛྲི་བཻྃ་བཛྲ་བཛྲྃ་བཻྃཿཀཻྃཿབཻྃཿཀཻྃཿབཻྃཿཀཻྃཿབཻྃཿཀཻྃཿབཻྃ་ཧཱུྃ་བྷྱོ་ཧཱུྃ་བྷྱོ་ཧཱུྃ་བྷྱོ།
en: Hūṁ, jaḥ jaḥ ! Ala ala ! Hūṇu Hūṇu ! Hraṁ hraṁ hraṁ ! Hū taṁ, ghai ghai, yai yai

source: རུ་ལུ་རུ་ལུ་རུ་ལུ་ཧཱུྃ་བྷྱོ་ཧཱུྃ་བྷྱོ་ཧཱུྃ་བྷྱོ། རྡོ་རྗེ་འཛིན་པ་ལ་སོགས་པའིའོ།
en: Ta ṭa, gho gho, ṣeṁ ṣeṁ, taṁ taṁ, ghe ghe, hondo hondo, do

source: །ཊཀྐི་ཧཱུྃ་ཛཿ།
en: Hūṁ hūṁ

source: ཊཀྐི་ཧཱུྃ་ཛཿ། ཊཀྐི་ཛཿ། འདི་ནི་རོལ་པའིའོ།
en: Kaka kaka , kau kau kau , vaiṃ vaiṃ , kaiṃ kaiṃ , krauṁ krauṁ krauṁ , vaiṁ

source: །ཏ་ཌ་བ་ཏ་ཌ་བ།
en: Vajra vajra , vajrīṁ vajrīṃ , vaiḥ , kaiṁ kaiṃ kaiṁ , hūṁ

source: བྲཧྨེ་བྲཧྨེ།
en: Bhyo bhyo bhyo

source: རྟ་མགྲིན་གྱིའོ། །ཧྲཱིྃ་ཥྚྲཱིྃ་ཧྲཱིྃ་ཥྚྲཱིྃ་ཧྲཱིྃ་ཥྚྲཱིྃ་ཥྚྲཱིྃ་ཥྚྲཱིྃ་ཥྚྲཱིྃ།
en: “The mantra of Līlāgati is as follows:

source: ཧྲཱི་ཥྟྲཱི་ཧྲཱི་ཥྟྲཱི་ཧྲཱི་ཥྟྲཱི།
en: Ṭaki, hūṁ, jaḥ jaḥ jaḥ!

source: གཤིན་རྗེའི་རྒྱལ་པོའིའོ། །ཧྲཱིྃ་ཧྲཱིྃ།
en: “The mantra of Hayagrīva is:

source: ཀུྃ་ཧྲཱིྃ་ཀུྃ་ཧྲཱིྃ་ཁནྟ་ཁེྃ་ཁནྟ་ཁེྃ་ཁནྟ་ཁེྃ།
en: Taḍava taḍava ! To the steed, the steed! “The mantra of Yamarāja is:

source: པདྨྃ་པདྨྃ། ཧྲཱིྃ་པདྨྃ་ཧྲཱིྃ་པདྨྃ། ཏྲཱིྃ་ཏྲཱིྃ་ཏྲཱིྃ་ཏྲཱིྃ་ཏྲཱིྃ་ཏྲཱིྃ། ཧྲཱིྃ་ཧྲཱིྃ་ཧྲཱིྃ་ཧྲཱིྃ་ཧྲཱིྃ་ཧྲཱིྃ། ཧྲཱིྃ་ཏྃ་ཧྲཱིྃ་ཏྃ།
en: Hrīṁ ṣṭrīṁ, hrīṁ ṣṭrīṁ, ṣṭrīṁ ṣṭrīṁ ṣṭrīṁ, hrīṁ ṣṭrīṁ, hrīṁ ṣṭrīṁ, hrīṁ ṣṭrīṁ ! “The mantra of Tārā is:

source: ཧྲཱིྃ་ཧྲཱིྃ་ཧྲཱིྃ། སྒྲོལ་མའིའོ།
en: Hrīṁ hrīṁ, kuṁ hrīṁ, kuṁ hrīṁ, khe khe, kheṁ kheṁ kheṁ, padmaṃ padmaṃ, hrīṁ, padmaṃ padmaṃ padmaṃ, trīṁ trāṁ, trīṁ trāṁ, trīṁ trāṁ, hrīṁ hrīṁ hrīṁ, hrī taṁ, hrī taṁ, hrīṁ hrīṁ hrīṁ!

source: །དེ་ནས་ཅང་ཏེའུའི་མཚན་ཉིད་བཤད།
en: “I will now describe the characteristics of the small hand drum used for these mantras. “One should make this drum from the root of a sandal tree

source: །བཛྲི་ཤིཪྴ་རྩ་བ་དང་། །ཙནྡན་དམར་པོ་ལས་བྱུང་དང་། །གཞན་རྣམས་གང་རྣམས་དེ་རྣམས་ནི།
en: Belonging to the red variety found in the Himālayas, And also any other articles

source: །ཡིད་ལ་འདོད་པ་རྣམས་ལ་བྱ།
en: That are pleasing to the mind.”

source: །དེ་ཡི་ཚད་འདི་བཀའ་སྩལ་པ།
en: Then the Blessed One specified the following measurements:

source: །བཅུ་གཉིས་པ་དང་བཅུ་པ་ཉིད།
en: “It should be twelve or ten finger-widths in length,

source: །ཁ་ལ་སོར་ནི་དྲུག་དང་ལྔ།
en: With a drumhead that is six or five finger-widths in diameter.

source: །དགུ་པ་དང་ནི་བཅུ་གཅིག་ཉིད།
en: It can also be nine or eleven finger-widths in length,

source: །ཁ་ལ་དེ་ཡི་ཕྱེད་ཉིད་དོ།
en: With the drumhead being half of that.

source: །གཞན་པ་ཡི་ཡང་རྔེའུ་ཆུང་ནི། །ཐོད་པ་ལས་ནི་བསྐོར་བ་ཉིད།
en: “Optionally, to make a different kind of drum,

source: །སྤྲེའུའི་པགས་པས་གཡོགས་པའོ།
en: “One should stretch monkey skin on a human skull, So that it forms its drumhead.

source: །དེ་བཞིན་ཁ་སྦྱོར་གཉིས་ལ་ནི། །པདྨ་དག་ནི་བྲི་བར་བྱ།
en: Inside each of the two hollows of the skull one should draw a lotus.

source: །བུད་མེད་ཁྲག་གིས་མཛེས་པ་དང་། །དུར་ཁྲོད་སྐྱེས་པའི་སྐྲ་ལས་ནི།
en: To make it beautiful, one should draw it with menstrual blood.

source: །བཀལ་ནས་རུས་པ་གཉིས་ནི་བཅིང་།
en: “One should tie together the two pieces of skull bone With a string twined from human hair recovered from a cemetery.

source: །ཁྱིམ་གྱི་མེ་ཏོག་གཉིས་ཀྱིས་ནི།
en: Then, using only ‘secret flower,’ one should draw a maṇḍala

source: །པདྨ་ཟེ་འབྲུ་གཉིས་པ་ལ། །དཀྱིལ་འཁོར་ཉིད་ནི་བྲི་བར་བྱ།
en: On the pericarp of each of the two lotuses in the hollows of the skull.

source: །མཚན་མོ་བཞི་མདོ་དག་ཏུ་ནི།
en: “One should go at nighttime to a crossroads and draw,

source: །རྐང་པ་གཡོན་པའི་མཐེ་བོང་གིས།
en: With the big toe of one’s left foot,

source: །དཀྱིལ་འཁོར་གྲུ་བཞི་མཚམས་སུ་ནི། །རྡོ་རྗེ་ལྕགས་ཀྱུ་བྲི་བར་བྱ།
en: A vajra hook in each of the corners Of a four-sided maṇḍala.

source: །དེར་གནས་གཡོན་པའི་ངོས་སུ་ནི།
en: “Stepping there with one’s left heel, one should recite kheṁ hūṁ

source: །ཇི་ལྟར་དང་པོར་མིང་བཟུང་བ།
en: Preceded by the summoning formula with the target’s name.

source: །ཁེཾ་ཧཱུྃ་ཞེས་ནི་བརྗོད་ནས་ནི།
en: While reciting kheṁ hūṁ

source: །ཆུ་སྐྱར་རྐང་པའི་རུས་པས་གདབ།
en: One should stomp one’s left foot in the manner of a lapwing.

source: །དེ་ལྟར་གཡོ་ལྡན་མ་ལ་སོགས།
en: “In this way, all the six Kambojīs

source: །ཐམས་ཅད་འགུགས་པར་བྱེད་པར་འགྱུར།
en: Will be summoned without a doubt.

source: །གལ་ཏེ་འོངས་པར་མ་གྱུར་ན།
en: If they do not come,

source: །དེ་ཚེ་མཁའ་འགྲོ་མ་ཀུན་འཆི།
en: All these ḍākinīs will die.

source: །ངེས་པ་ཉིད་དུ་འགྲུབ་འགྱུར་བས།
en: “So they will certainly respond to the ritual;

source: །ངས་གསུངས་པ་ལ་ཐེ་ཚོམ་མེད།
en: There is no doubt about what I have said.

source: །གལ་ཏེ་ཁྲོས་པས་སློབ་དཔོན་གྱིས། །ཅང་ཏེའུ་རྡུང་བར་བྱེད་པ་ན། །དེ་ཚེ་མཆི་མ་འཛག་ཅིང་ངུ་།
en: “If the master plays the ḍamaru when agitated, the ḍākinīs will cry a torrent of tears.

source: །ཁྱོད་ནི་དམ་ཚིག་ལ་ནི་ཁྲོ་བོ་སྔོན་པོ་མཛེས།
en: ‘Your samaya conduct shines brightly, O Blue Angry One!

source: །དངོས་གྲུབ་ཕྱག་ན་དབྱིག་ཏོ་རིན་ཆེན་བཅིངས་པ་འཛིན།
en: In your hand you hold a staff set with precious stones.

source: །ཀྱེ་དཔལ་ལྡན་དཔའ་བོ་འདུ་བར་འཁོར་བ་སྒྲོལ་བ་འཁུམས།
en: Behold me, O hero, amidst the yoginīs, entering the door to the assembly,

source: །མཁའ་མཛེས་རྣལ་འབྱོར་མ་ཡི་ནང་དུ་བདག་ཐོང་ཤིག །ཚོགས་ཀྱི་འདུ་བ་བཟང་པོ་ཉིད།
en: The assembly that is the liberated saṃsāra.’

source: །འདོད་པའི་དོན་ཀུན་སྒྲུབ་པ་མོ། །གང་དུ་ཟོས་པས་འགྲུབ་འགྱུར་བ།
en: One that will bring the fulfillment of all wishes.

source: །དུར་ཁྲོད་རི་ཡི་ཚང་ཚིང་དང་། །རྒྱ་མཚོ་ཆེན་པོའི་འགྲམ་དུ་འམ།
en: “In a charnel ground, a mountain thicket, On the shore of a great ocean,

source: །ཡང་ན་དབེན་པའམ་བས་མཐའ་རུ།
en: In a deserted place or wilderness,

source: །བཟའ་བ་འདི་དག་ཡང་དག་བརྩམ།
en: One should prepare the following articles of enjoyment:

source: །མེ་ཏོག་བདུག་པ་མར་མེ་དང་། །དེ་བཞིན་བཟའ་བ་བཅའ་བ་ཉིད།
en: “Flowers, incense, and lamps, And also hard and soft foodstuffs.

source: །ཆང་ནི་སྒེག་མོ་རུ་ནི་བརྗོད།
en: The liquor is said to be a playful woman;

source: །སྦྲང་ཆང་རབ་ཏུ་མྱོས་མར་བརྗོད།
en: The wine is said to be a wanton woman.

source: །བུ་རམ་ཆང་ནི་མྱོས་བྱེད་གསུངས།
en: “The rum is said to be the god of love;

source: །སྙིང་པོ་བདུད་རྩི་རྒུན་ཆང་ཡིན།
en: This best of alcohols is ambrosia.

source: །སངས་རྒྱས་ཀུན་གྱི་ཀླ་ཀློ་ཡིས།
en: Through the outcaste of all buddhas,

source: །བདུད་རྩི་ལམ་ནི་ཡན་ལག་བརྒྱད།
en: Ambrosia is the eightfold path.

source: །རྒུན་འབྲུམ་སྦྲང་རྩི་དཔའ་བོ་གཅིག །ཉ་ཕྱིས་རྩུབ་པའི་འདོད་པ་ཅན།
en: “The sweet grape wine is the Sole Hero; The oyster shell is the One with Harsh Desire.

source: །སིངས་པོ་བཤང་བར་བརྗོད་པ་སྟེ།
en: The rice brew is said to be a sensualist,

source: །རྩབས་དང་བྲན་མོ་སིངས་པོར་བརྗོད།
en: And the rice brew is said to be a female slave. “By having the good fortune to partake,

source: །དེ་ལྟར་བཟའ་བ་སྣ་ཚོགས་དང་། །ཆང་དང་ཉ་དང་ཡང་དག་ལྡན། །དགའ་བའི་ལོངས་སྤྱོད་སྐལ་བཟང་བས།
en: In this way, of such delicacies As various foods, alcoholic beverages, and fish,

source: །དཔལ་ལྡན་རྡོ་རྗེ་སེམས་དཔའ་འགྲུབ།
en: One will attain the level of glorious Vajrasattva.

source: །ཨ་མྲ་སྨིན་དང་པ་ན་སྃ།
en: “Ripe mangoes, breadfruit,

source: །རྒུན་འབྲུམ་ན་རི་ཀེ་ལ་དང་། །ཨཱ་ལུ་ཀ་ལ་སོགས་པ་ནི།
en: Grapes, coconuts, plums, and so forth— One should offer, at the gaṇacakra gathering,

source: །འབྲས་བུ་སྣ་ཚོགས་ཐ་དད་པ། །ཚོགས་ཀྱི་དཀྱིལ་འཁོར་དབུལ་བར་བྱ།
en: An assortment of different fruits.

source: །འདིས་ནི་གླུ་དང་ཕྱག་རྒྱ་དང་། །ངེས་པར་གར་ཀྱང་ཁྱད་པར་དུའོ།
en: “A special dance should be performed, along with gestures and singing:

source: །ཀ་ཀ་ཀ་ཀ་ཀ་ཀ་ཀ་ཀ །ཧི་ཧི་ཧི་ཧི་ཧི་ཧི་ཧི་ཧི། ཧྲིཾ་ཧྲིཾ་ཧྲིཾ་ཧྲིཾ། ཧཱུྃ་ཧཱུྃ་ཧཱུྃ་ཧཱུྃ་ཧཱུྃ་ཧཱུྃ་ཧཱུྃ་ཧཱུྃ་ཧཱུྃ། ཧཱ་ཧཱ་ཧཱ་ཧཱ་ཧཱ་ཧཱ་ཧཱ་ཧཱ་ཧཱ་ཧཱ་ཧཱ་ཧཱ། ཨི་ཧཱ་ཧཱ་ཨི་ཧཱ་ཧཱ། ཧཱ་ཧཱ་ཧཱ། ཛཱྃ་ཛཱྃ་ཛཱྃ་ཛཱྃ། ཨ་ཨི་ཨ་ཨི་ཨ་ཨི། ཛཱྃ་ཛཱ། ཨིཾ་ཛེཾ་ཛཱཾ།
en: Ka ka ka ka ka, hi hi hi hi, hīṁ hīṁ hīṁ hīṁ, hūṁ hūṁ hūṁ, hūṁ hūṁ hūṁ, hūṁ hūṁ hūṁ, hā hā hā hā, hā hā hā hā, hā hā hā hā, i hā hā, i hā hā, ḍā ḍā ḍā, jāṁ jāṁ jāṁ jāṁ, a i u, jaṁ jāṁ, iṁ jāṁ, iṁ jāṁ, iṁ iṁ, jeṁ jeṁ jeṁ, iṁ teṁ traṁ, hi hi hi hi, hīḥ hīḥ hīḥ, hi hi hi, hī hī hī, hī hī hī, hī hī hī, kajjaṃ, hi hī.

source: ཨིཾ་ཛཱ་ཨིཾ་ཛཱ་ཨིཾ་ཛཱ་ཨིཾ་ཛེཾ་ཛེཾ་ཛེཾ་ཨིཾ་ཏེ་ཨྃ། ཧི་ཧི་ཧི་ཧི་ཧཱི། ཧི་ཧི་ཧི་ཧི་ཧཱི། ཧི་ཧི་ཧི་ཧི་ཧཱི། ཧི་ཧི་ཧི་ཧི་ཧཱི། ཧི་ཧི་ཧི་ཧཱི། ཉྫ་ཧཱི་ཧཱི་ཧི་ཧི་ཧི་ཧཱི་ཉྫ་ཧཱི་ཧཱི་ཧི་ཧི་ཧི་ཧཱི། ཀརྫ་ཧི་ཧི། དེ་ལྟར་ཀླ་ཀླས་ཀུན་འདར་ཉིད།
en: “Singing thus, an outcaste woman shakes to this song.

source: །ཧེ་རུ་ཀ་ཡི་སྦྱོར་བས་གར། །ཕྱག་རྒྱ་ཉིད་ཀྱང་ཁྱད་པར་དུའོ།
en: The dance, and in particular the ritual gestures, Should be performed while in meditative union with Heruka.

source: །གང་ཕྱིར་ལྟ་སྟངས་དེ་ཁུ་ཚུར།
en: “Since the gazes correspond with the fist gestures,

source: །ལྟ་སྟངས་ཁུ་ཚུར་རྐང་པས་རྐང་།
en: And both are synchronized with the footsteps of the dance,

source: །ཇི་ལྟར་རྣལ་འབྱོར་རིམ་པ་ལས།
en: They express the stages of yoga

source: །སངས་རྒྱས་ཀུན་གྱིས་རྣམ་པར་མཛད།
en: As performed by all the buddhas. “The consort could be one’s mother,

source: །སྲིང་མོའི་བུ་མོ་སྒྱུག་མོ་དང་། །མ་དང་སྲིང་མོ་ཡིན་ན་ཡང་།
en: Sister, younger sister, or niece.

source: །དེ་རྣམས་གང་བར་མཆོད་ནས་ནི།
en: One should worship them ardently,

source: །ཚོགས་ཀྱི་དཀྱིལ་འཁོར་འགྲུབ་པར་འགྱུར།
en: And one will gain accomplishment at the gaṇacakra feast. “The pupil should present to his master, O fortunate lady,

source: །སྐྱེས་པའི་ཐོད་ཆེན་ཆ་གཅིག་པར།
en: A human skull cup made from a single piece of bone,

source: །ཆང་ནི་བཟང་པོས་ཡོངས་བཀང་སྟེ། །བླ་མ་ལ་དབུལ་སྐལ་ཆེན་མ།
en: Filled with divinely delicious wine.

source: །ཕྱག་འཚལ་ནས་ནི་རང་ཡང་བཏུང་།
en: Having made obeisance to him, he should drink of it himself. “He should hold it and offer it

source: །པདྨའི་ལག་པས་བླང་བ་དང་། །དེ་ཉིད་ཀྱི་ནི་ལག་པས་དབུལ།
en: With the same hand forming a lotus gesture.

source: །ཡང་ནས་ཡང་དུ་ཕྱག་འཚལ་བ།
en: The officiants should bow at this point

source: །དེ་ལ་སྒྲུབ་པ་པོ་ཡིས་བྱ།
en: To the master again and again.”
